app/Models/ModelUser.php

SELECT *
FROM `user`
WHERE `email` = 'admin@harmonisgold.com'
AND `password` = '7c4a8d09ca3762af61e59520943dc26494f8941b'
---
    public function LoginUser($email,$password)
    {
        return $this->db->table('user')
        ->where([
            'email' => $email,
            'password' => $password,
        ])
        ->get()->getRowArray();