app/Models/ModelLaporan.php

SELECT *
FROM `penjualan`
WHERE `penjualan`.`tanggal_penjualan` = '2023-01-25'
AND `tipe_penjualan` = 'Emas'
---
    public function DataJualHarian($tgl)
    {
        $emas = "tipe_penjualan='Emas'";
        return $this->db->table('penjualan')
            ->where('penjualan.tanggal_penjualan', $tgl)
            ->where($emas)
            ->get()
            ->getResultArray();