app/Models/ModelAdmin.php

    public function DataJualHariIni($data)
    {
        //Fungsi Data Tanggal Hari Ini
        $hasil = $this->db->table('penjualan')
        ->where('penjualan.tanggal_penjualan', $data)
        ->selectSum('penjualan.berat_penjualan')
        ->selectSum('penjualan.harga_penjualan')
        ->get()
        ->getResultArray();
---
SELECT SUM(`penjualan`.`berat_penjualan`) AS `berat_penjualan`, SUM(`penjualan`.`harga_penjualan`) AS `harga_penjualan`
FROM `penjualan`
WHERE `penjualan`.`tanggal_penjualan` = '20230126'

    public function DataBeliHariIni($data)
    {
        //Fungsi Data Tanggal Hari Ini
        $hasil = $this->db->table('pembelian')
        ->where('pembelian.tanggal_pembelian', $data)
        ->selectSum('pembelian.berat_pembelian')
        ->selectSum('pembelian.harga_pembelian')
        ->get()
        ->getResultArray();
---
SELECT SUM(`pembelian`.`berat_pembelian`) AS `berat_pembelian`, SUM(`pembelian`.`harga_pembelian`) AS `harga_pembelian`
FROM `pembelian`
WHERE `pembelian`.`tanggal_pembelian` = '20230126'